backend/load-test.yml
config:
  target: 'http://localhost:5000'
  phases:
    - duration: 60
      arrivalRate: 10
      name: 'Warm up phase'
    - duration: 120
      arrivalRate: 50
      name: 'Sustained load'
    - duration: 30
      arrivalRate: 200
      name: 'Spike'

scenarios:
  - name: 'Browse Catalog'
    flow:
      - get:
          url: '/api/products'
      - think: 2
      - get:
          url: '/api/products/search?q=fan'
      - think: 1
      - get:
          url: '/api/products/category/fan'